## DataFrame
### 누락데이타 처리하기

    누락데이타 값 삭제하기 - dropna()
    
    데이터를 보면 값이 없는 경우가 있다. 
    이런 경우 missing value 가 있다고 한다.
    데이타 분석을 본격적으로 하기 전에 Missing value 처리 전략을 세우는 것은
    데이타 전처리 과정에서 매우 중요하다
    
    대표적인 처리전략
    1) 데이터가 거의 없는 feature 는 feature 자체를 DROP
    2) 데이터의 최소 개수를 정해서 DROP
    3) 최빈값, 평균값, 0 등의 값으로 비어있는 데이터를 채우기
    
    판다스는 누락된 데이타를 모두 NaN으로 처리한다.
    판다스 객체의 모든 통계는 누락된 데이타를 배제하고 처리한다
    
    누락데이타와 관련된 기능
    dropna() : na이 하나라도 있는 로우는 모두 DROP
    dropna(how='all') :모든 값이 na인것만 DROP
    dropna(thresh=3) : not-nan value가 3개이상이 임계치
                       3개 이상인 데이타만 남기겠다.해당 임계치 안되면 DROP
    dropna(how='any') : 누락데이터가 한개라도 있으면 DROP 해라 
    fillna() :누락된 데이타 값을 다른 값으로 채움
    isnull() or isna() : 누락되거나 NA인 값을 알려줌
    notnull() :insull()과 반대

In [1]:
from numpy import nan as NA
import numpy as np
from pandas import DataFrame

In [2]:
df = DataFrame([[1,6.5,3],[1,NA,NA],[NA,NA,NA],[NA,6.5,3]])
df

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [3]:
# 1. dropna()
removeNa = df.dropna()
removeNa

     0    1    2
0  1.0  6.5  3.0

In [4]:
df #원본은 유지된다.

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [5]:
# 2. dropna(how="all")
df.dropna(how="all")

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [6]:
# 3. dropna(thresh=3)
df.dropna(thresh=3)

     0    1    2
0  1.0  6.5  3.0

In [7]:
df

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

### 누락데이터 채우기

In [10]:
df.fillna(0) #원본은 유지한다.

     0    1    2
0  1.0  6.5  3.0
1  1.0  0.0  0.0
2  0.0  0.0  0.0
3  0.0  6.5  3.0

In [12]:
# 평균으로 채우기
df.fillna(df.mean())

     0    1    2
0  1.0  6.5  3.0
1  1.0  6.5  3.0
2  1.0  6.5  3.0
3  1.0  6.5  3.0

In [13]:
# 특정한 값으로 채우기
df.fillna(value=5)

     0    1    2
0  1.0  6.5  3.0
1  1.0  5.0  5.0
2  5.0  5.0  5.0
3  5.0  6.5  3.0

In [14]:
df

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [15]:
df.fillna(method="ffill")

     0    1    2
0  1.0  6.5  3.0
1  1.0  6.5  3.0
2  1.0  6.5  3.0
3  1.0  6.5  3.0